In [67]:
import numpy as np
import pandas as pd

In [68]:
s1 = np.random.randint(1,10,5)
s2 = np.random.randint(1,10,5)
s3 = np.random.randint(1,10,5)

In [69]:
dictt = {"var1" : s1 , "var2" : s2 , "var3" : s3}

In [70]:
df = pd.DataFrame(dictt) #sözlük ile dataframe olusturma işlemi
df

   var1  var2  var3
0     5     3     9
1     4     5     9
2     1     4     5
3     3     2     5
4     1     6     8

In [71]:
df.index = ([f"degisken_{i+1}" for i in range(5)]) # sonradan index isimlendirmesi 
df

            var1  var2  var3
degisken_1     5     3     9
degisken_2     4     5     9
degisken_3     1     4     5
degisken_4     3     2     5
degisken_5     1     6     8

### İndex İsmi İle Slice

In [72]:
df["degisken_1" : "degisken_3"]

            var1  var2  var3
degisken_1     5     3     9
degisken_2     4     5     9
degisken_3     1     4     5

### Eleman Silme

In [73]:
df.drop("degisken_1" , axis=0) # axis = 0 oldugu için satır bazında silme işlem yaptı ama bu orjinal Dataframede yapmadı

            var1  var2  var3
degisken_2     4     5     9
degisken_3     1     4     5
degisken_4     3     2     5
degisken_5     1     6     8

In [74]:
df.drop("degisken_1" , axis=0 , inplace=True) # inplace özelliğini True yaparak orjinal dataframe de silme işlemi gerçekleşir
df

            var1  var2  var3
degisken_2     4     5     9
degisken_3     1     4     5
degisken_4     3     2     5
degisken_5     1     6     8

### Fancy İndex İle Silme İslemi

In [75]:
l = ["degisken_3","degisken_4"]

In [76]:
df.drop(l,axis=0) # bir isim listesi vererek silme işlemi yapabiliriz

            var1  var2  var3
degisken_2     4     5     9
degisken_5     1     6     8

In [77]:
df["var4"] = [1,2,3,5] # eğer farklı bir sütun ismi girersek yeni bir sütun oluşturulur ve degerler eklenir
df

            var1  var2  var3  var4
degisken_2     4     5     9     1
degisken_3     1     4     5     2
degisken_4     3     2     5     3
degisken_5     1     6     8     5

In [79]:
df.drop("var4" , axis=1 , inplace=True) # sütun bazında silme
df

            var1  var2  var3
degisken_2     4     5     9
degisken_3     1     4     5
degisken_4     3     2     5
degisken_5     1     6     8